
clear
clf
clc

b11=160730000000;
b12=6440000000;
b13=6440000000;
b22=13920000000;
b23=6920000000;
b33=13920000000;
b44=3500000000;
b55=7070000000;
b66=7070000000;
rou=1200;

dd1=0.001;%三层板，每层板的厚度
dd2=0.001;%三层板，每层板的厚度
dd3=0.001;%三层板，每层板的厚度
%==
%f=200050.0;
%c=3488.75;
%f=120050;
%c=1720;
f=150050;%频率和相速度的选择可以确定一个模式。
c=2850;

B1=wyy1(f,c,dd1);%把每一层分成100层，然后采用传递矩阵法 通过while循环得到每一层上表面和下表面的总体B1。
B2=wyy2(f,c,dd2);%把每一层分成100层，然后采用传递矩阵法 通过while循环得到每一层上表面和下表面的总体B1。
B3=wyy1(f,c,dd3);%把每一层分成100层，然后采用传递矩阵法 通过while循环得到每一层上表面和下表面的总体B1。

B=B3*B2*B1;%通过把每一层的传递矩阵相乘，得到三层板最下表面和最上表面的传递矩阵,同时注意矩阵相乘的顺序。
%==
ux0=1;%第一层上表面的x方向的位移ux1为1，通过第50页式（3.68）可得第一层上表面uy0和uz0
uy0=(-B(4,1)*B(5,3)+B(5,1)*B(4,3))/(B(4,2)*B(5,3)-B(4,3)*B(5,2));%将ux0=1代入第50页式（3.68）计算得到。
uz0=(-B(4,1)*B(5,2)+B(5,1)*B(4,2))/(B(4,3)*B(5,2)-B(4,2)*B(5,3));
%layer one
d1=linspace(0,0.001,100);
A1=wyy1(f,c,d1);%第一层采用各向同性，即经典lamb波的层状公式，第45页公式。

d2=linspace(0,0.001,100);%第二层采用各向同性，即各向异性lamb波的层状公式，第33页公式。
A2=wyy2(f,c,d2);

d3=linspace(0,0.001,100);%第三层采用各向同性，即经典lamb波的层状公式，第45页公式。
A3=wyy1(f,c,d3);


%

for m1=1:100; %每1层中的微分思想
    %A1为一矩阵，该矩阵的每6层为其中某m层的传递矩阵，所以B11，B12，...B66都是第一层中第m分层中的传递矩阵元素。
B11(m1)=A1(1+(m1-1)*6,1);B12(m1)=A1(1+(m1-1)*6,2);B13(m1)=A1(1+(m1-1)*6,3);B14(m1)=A1(1+(m1-1)*6,4);B15(m1)=A1(1+(m1-1)*6,5);B16(m1)=A1(1+(m1-1)*6,6);
B21(m1)=A1(2+(m1-1)*6,1);B22(m1)=A1(2+(m1-1)*6,2);B23(m1)=A1(2+(m1-1)*6,3);B24(m1)=A1(2+(m1-1)*6,4);B25(m1)=A1(2+(m1-1)*6,5);B26(m1)=A1(2+(m1-1)*6,6);
B31(m1)=A1(3+(m1-1)*6,1);B32(m1)=A1(3+(m1-1)*6,2);B33(m1)=A1(3+(m1-1)*6,3);B34(m1)=A1(3+(m1-1)*6,4);B35(m1)=A1(3+(m1-1)*6,5);B36(m1)=A1(3+(m1-1)*6,6);
B41(m1)=A1(4+(m1-1)*6,1);B42(m1)=A1(4+(m1-1)*6,2);B43(m1)=A1(4+(m1-1)*6,3);B44(m1)=A1(4+(m1-1)*6,4);B45(m1)=A1(4+(m1-1)*6,5);B46(m1)=A1(4+(m1-1)*6,6);
B51(m1)=A1(5+(m1-1)*6,1);B52(m1)=A1(5+(m1-1)*6,2);B53(m1)=A1(5+(m1-1)*6,3);B54(m1)=A1(5+(m1-1)*6,4);B55(m1)=A1(5+(m1-1)*6,5);B56(m1)=A1(5+(m1-1)*6,6);
B61(m1)=A1(6+(m1-1)*6,1);B62(m1)=A1(6+(m1-1)*6,2);B63(m1)=A1(6+(m1-1)*6,3);B64(m1)=A1(6+(m1-1)*6,4);B65(m1)=A1(6+(m1-1)*6,5);B66(m1)=A1(6+(m1-1)*6,6);

%所以ux1，uy1，...tzz1.tzx1...都是第m层中的位移和应力元素。
ux1(m1)=B11(m1)*ux0+B12(m1)*uy0+B13(m1)*uz0;  %原因可以参考第50页的笔记推导，第一层的上表面位移不为零，应力为零，故B14之后的都乘0，
uy1(m1)=B21(m1)*ux0+B22(m1)*uy0+B23(m1)*uz0;
uz1(m1)=B31(m1)*ux0+B32(m1)*uy0+B33(m1)*uz0;
tzz1(m1)=B41(m1)*ux0+B42(m1)*uy0+B43(m1)*uz0;
tzx1(m1)=B51(m1)*ux0+B52(m1)*uy0+B53(m1)*uz0;
tzy1(m1)=B61(m1)*ux0+B62(m1)*uy0+B63(m1)*uz0;

%%====

%%====
end

for m2=1:100; %每2层中的微分思想
    %A2为一矩阵，该矩阵的每6层为其中某m层的传递矩阵，所以C11，C12，...C66都是第二层中第m分层中的传递矩阵元素。
C11(m2)=A2(1+(m2-1)*6,1);C12(m2)=A2(1+(m2-1)*6,2);C13(m2)=A2(1+(m2-1)*6,3);C14(m2)=A2(1+(m2-1)*6,4);C15(m2)=A2(1+(m2-1)*6,5);C16(m2)=A2(1+(m2-1)*6,6);
C21(m2)=A2(2+(m2-1)*6,1);C22(m2)=A2(2+(m2-1)*6,2);C23(m2)=A2(2+(m2-1)*6,3);C24(m2)=A2(2+(m2-1)*6,4);C25(m2)=A2(2+(m2-1)*6,5);C26(m2)=A2(2+(m2-1)*6,6);
C31(m2)=A2(3+(m2-1)*6,1);C32(m2)=A2(3+(m2-1)*6,2);C33(m2)=A2(3+(m2-1)*6,3);C34(m2)=A2(3+(m2-1)*6,4);C35(m2)=A2(3+(m2-1)*6,5);C36(m2)=A2(3+(m2-1)*6,6);
C41(m2)=A2(4+(m2-1)*6,1);C42(m2)=A2(4+(m2-1)*6,2);C43(m2)=A2(4+(m2-1)*6,3);C44(m2)=A2(4+(m2-1)*6,4);C45(m2)=A2(4+(m2-1)*6,5);C46(m2)=A2(4+(m2-1)*6,6);
C51(m2)=A2(5+(m2-1)*6,1);C52(m2)=A2(5+(m2-1)*6,2);C53(m2)=A2(5+(m2-1)*6,3);C54(m2)=A2(5+(m2-1)*6,4);C55(m2)=A2(5+(m2-1)*6,5);C56(m2)=A2(5+(m2-1)*6,6);
C61(m2)=A2(6+(m2-1)*6,1);C62(m2)=A2(6+(m2-1)*6,2);C63(m2)=A2(6+(m2-1)*6,3);C64(m2)=A2(6+(m2-1)*6,4);C65(m2)=A2(6+(m2-1)*6,5);C66(m2)=A2(6+(m2-1)*6,6);

%所以ux2，uy2，...tzz2.tzx2...都是第m层中的位移和应力元素。
%ux1(100)为第一层的下表面，也就是第二层的上表面，和上面第一层一样，作为已知量来处理。
%第一层的下表面也就是第二层吃的上表面表面位移不为零，应力也不为零，故C14之后的都继续相乘，而不像第一层那样都乘以0，
ux2(m2)=C11(m2)*ux1(100)+C12(m2)*uy1(100)+C13(m2)*uz1(100)+C14(m2)*tzz1(100)+C15(m2)*tzx1(100)+C16(m2)*tzy1(100);
uy2(m2)=C21(m2)*ux1(100)+C22(m2)*uy1(100)+C23(m2)*uz1(100)+C24(m2)*tzz1(100)+C25(m2)*tzx1(100)+C26(m2)*tzy1(100);
uz2(m2)=C31(m2)*ux1(100)+C32(m2)*uy1(100)+C33(m2)*uz1(100)+C34(m2)*tzz1(100)+C35(m2)*tzx1(100)+C36(m2)*tzy1(100);
tzz2(m2)=C41(m2)*ux1(100)+C42(m2)*uy1(100)+C43(m2)*uz1(100)+C44(m2)*tzz1(100)+C45(m2)*tzx1(100)+C46(m2)*tzy1(100);
tzx2(m2)=C51(m2)*ux1(100)+C52(m2)*uy1(100)+C53(m2)*uz1(100)+C54(m2)*tzz1(100)+C55(m2)*tzx1(100)+C56(m2)*tzy1(100);
tzy2(m2)=C61(m2)*ux1(100)+C62(m2)*uy1(100)+C63(m2)*uz1(100)+C64(m2)*tzz1(100)+C65(m2)*tzx1(100)+C66(m2)*tzy1(100);


end

for m3=1:100
   
D11(m3)=A1(1+(m3-1)*6,1);D12(m3)=A1(1+(m3-1)*6,2);D13(m3)=A1(1+(m3-1)*6,3);D14(m3)=A1(1+(m3-1)*6,4);D15(m3)=A1(1+(m3-1)*6,5);D16(m3)=A1(1+(m3-1)*6,6);
D21(m3)=A1(2+(m3-1)*6,1);D22(m3)=A1(2+(m3-1)*6,2);D23(m3)=A1(2+(m3-1)*6,3);D24(m3)=A1(2+(m3-1)*6,4);D25(m3)=A1(2+(m3-1)*6,5);D26(m3)=A1(2+(m3-1)*6,6);
D31(m3)=A1(3+(m3-1)*6,1);D32(m3)=A1(3+(m3-1)*6,2);D33(m3)=A1(3+(m3-1)*6,3);D34(m3)=A1(3+(m3-1)*6,4);D35(m3)=A1(3+(m3-1)*6,5);D36(m3)=A1(3+(m3-1)*6,6);
D41(m3)=A1(4+(m3-1)*6,1);D42(m3)=A1(4+(m3-1)*6,2);D43(m3)=A1(4+(m3-1)*6,3);D44(m3)=A1(4+(m3-1)*6,4);D45(m3)=A1(4+(m3-1)*6,5);D46(m3)=A1(4+(m3-1)*6,6);
D51(m3)=A1(5+(m3-1)*6,1);D52(m3)=A1(5+(m3-1)*6,2);D53(m3)=A1(5+(m3-1)*6,3);D54(m3)=A1(5+(m3-1)*6,4);D55(m3)=A1(5+(m3-1)*6,5);D56(m3)=A1(5+(m3-1)*6,6);
D61(m3)=A1(6+(m3-1)*6,1);D62(m3)=A1(6+(m3-1)*6,2);D63(m3)=A1(6+(m3-1)*6,3);D64(m3)=A1(6+(m3-1)*6,4);D65(m3)=A1(6+(m3-1)*6,5);D66(m3)=A1(6+(m3-1)*6,6);

%所以ux2，uy2，...tzz2.tzx2...都是第m层中的位移和应力元素。
%ux1(100)为第二层的下表面，也就是第三层的上表面，和上面第一层一样，作为已知量来处理。
%第二层的下表面也就是第三层的上表面，表面位移不为零，应力也不为零，故D14之后的都继续相乘，而不像第一层那样都乘以0，
ux3(m3)=D11(m3)*ux2(100)+D12(m3)*uy2(100)+D13(m3)*uz2(100)+D14(m3)*tzz2(100)+D15(m3)*tzx2(100)+D16(m3)*tzy2(100);
uy3(m3)=D21(m3)*ux2(100)+D22(m3)*uy2(100)+D23(m3)*uz2(100)+D24(m3)*tzz2(100)+D25(m3)*tzx2(100)+D26(m3)*tzy2(100);
uz3(m3)=D31(m3)*ux2(100)+D32(m3)*uy2(100)+D33(m3)*uz2(100)+D34(m3)*tzz2(100)+D35(m3)*tzx2(100)+D36(m3)*tzy2(100);
tzz3(m3)=D41(m3)*ux2(100)+D42(m3)*uy2(100)+D43(m3)*uz2(100)+D44(m3)*tzz2(100)+D45(m3)*tzx2(100)+D46(m3)*tzy2(100);
tzx3(m3)=D51(m3)*ux2(100)+D52(m3)*uy2(100)+D53(m3)*uz2(100)+D54(m3)*tzz2(100)+D55(m3)*tzx2(100)+D56(m3)*tzy2(100);
tzy3(m3)=D61(m3)*ux2(100)+D62(m3)*uy2(100)+D63(m3)*uz2(100)+D64(m3)*tzz2(100)+D65(m3)*tzx2(100)+D66(m3)*tzy2(100);
end

d=linspace(0,0.003,300);
u=[ux1 ux2 ux3];
v=[uy1 uy2 uy3];
w=[uz1 uz2 uz3];
tt1=[u v w];
tt1=max(abs(tt1));
tzz=[tzz1 tzz2 tzz3];
tzx=[tzx1 tzx2 tzx3];
tzy=[tzy1 tzy2 tzy3];
tt2=[tzz tzx tzy];
tt2=max(abs(tt2));
subplot(121)
plot(d*1000,u/tt1,d*1000,v/tt1,d*1000,imag(w)/tt1)
axis([0 3 -1 1])
subplot(122)
plot(d*1000,tzz/tt2,d*1000,imag(tzx)/tt2,d*1000,imag(tzy)/tt2)
axis([0 3 -1 1])

wv=[d*1000;u/tt1;v/tt1;imag(w)/tt1;d*1000;tzz/tt2;imag(tzx)/tt2;imag(tzy)/tt2];
% fid1=fopen('d:\zhy1\haiyan\data\ch4\wy61s.dat','wt');
% fprintf(fid1,'\n%f  %f  %f  %f  %f  %f  %f  %f',wv);
% fclose(fid1);
